app/Providers/AppServiceProvider.php

    public function boot(): void
    {
        // Global setting available in all views
        $setting = Setting::first();
        View::composer('*', function ($view) use ($setting) {
            $view->with('globalSetting', $setting);
        });

        // Sidebar-specific data
        View::composer('components.sidebar', function ($view) {
            $view->with([
                'trashedPlacesCount' => Place::onlyTrashed()->count(),
                'trashedCategoriesCount' => Category::onlyTrashed()->count(),
                'trashedReviewsCount' => Review::onlyTrashed()->count(),
            ]);
        });
---
select count(*) as aggregate from `places` where `places`.`deleted_at` is not null
select count(*) as aggregate from `categories` where `categories`.`deleted_at` is not null
select count(*) as aggregate from `reviews` where `reviews`.`deleted_at` is not null