app/Http/Controllers/Admin/AdminController.php

    public function index()
    {
        $numOfUsers = count(User::all());
        $numOfPlaces = count(Place::all());
        $numOfCategory = count(Category::all());
        $numOfReviews = count(Review::all());

        $topPlaces = Place::withAvg('reviews', 'rating')
            ->orderByDesc('reviews_avg_rating')
            ->take(5)
            ->get()
            ->map(function ($place) {
                $place->avg_rating = $place->reviews_avg_rating ?? 0;
                return $place;
            });
---
select * from `users`
select * from `places`
select * from `categories`
select * from `reviews`
select `places`.*, (select avg(`reviews`.`rating`) from `reviews` where `places`.`id` = `reviews`.`place_id`) as `reviews_avg_rating` from `places` order by `reviews_avg_rating` desc limit 5