app/Http/Controllers/Admin/CategoryController.php

    public function index()
    {
        return view('admin.category.index', [
            'categories' => Category::paginate()
        ]);
---
select * from `categories` where `categories`.`deleted_at` is null limit 15 offset 0
select count(*) as aggregate from `categories` where `categories`.`deleted_at` is null

    public function destroy(Category $category)
    {

        if ($category->places()->count() > 0) {
            return redirect()->back()->with('fail', 'Cannot delete this category. It has associated places.');
        }

        $category->delete();

        return redirect()->back()->with('success', 'Category deleted successfully.');
---
delete from `categories` where `id` = 10
update `categories` set `deleted_at` = '2025-07-03 12:38:08', `categories`.`updated_at` = '2025-07-03 12:38:08' where `id` = 9
select * from `categories` where `categories`.`deleted_at` is not null