app/Http/Controllers/Admin/PlaceController.php

    public function index()
    {
        return view('admin.places.index', [
            'places' => Place::with('category', 'images')->filter(request(['search', 'category', 'sort']))->paginate(),
            'categories' => Category::all()
        ]);
---
select * from `categories` where `categories`.`id` in (1, 3, 4, 6, 7, 10) and `categories`.`deleted_at` is null
select * from `images` where `images`.`place_id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16)
select * from `places` where exists (select * from `categories` where `places`.`category_id` = `categories`.`id` and `id` = '2') order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `places` where exists (select * from `categories` where `places`.`category_id` = `categories`.`id` and `id` = '2')
select * from `categories` where `categories`.`deleted_at` is null

    public function destroy(Place $place)
    {

        $place->delete();

        return redirect()->back()->with('success', 'Place deleted successfully.');
---
update `places` set `deleted_at` = '2025-07-03 12:30:28', `places`.`updated_at` = '2025-07-03 12:30:28' where `id` = 1
select * from `places` where `places`.`deleted_at` is not null