app/Http/Controllers/Admin/ReviewController.php

select * from `places` where `places`.`id` in (5, 7, 11, 12, 14, 16, 17, 20) and `places`.`deleted_at` is null
select * from `reviews` where `reviews`.`deleted_at` is null limit 15 offset 0
select * from `users` where `users`.`id` in (1, 2, 4, 5, 7, 8, 9, 10)
select count(*) as aggregate from `reviews` where `reviews`.`deleted_at` is null
---
    public function index()
    {
        return view('admin.review.index', [
            'reviews' => Review::with('user', 'place')->filter(request(['search', 'rating', 'status']))->paginate()
        ]);

update `reviews` set `status` = 'approved', `reviews`.`updated_at` = '2025-07-03 05:32:12' where `id` = 2
---
    public function approve(Review $review)
    {

        $review->status = 'approved';
        $review->save();

update `reviews` set `status` = 'rejected', `reviews`.`updated_at` = '2025-07-03 05:29:09' where `id` = 5
---
    public function reject(Review $review)
    {
        $review->status = 'rejected';
        $review->save();

update `reviews` set `deleted_at` = '2025-07-03 12:51:32', `reviews`.`updated_at` = '2025-07-03 12:51:32' where `id` = 2
---
    public function destroy(Review $review)
    {

        // Mail::to($review->user->email)->send(new ReviewRemovedMail($review));

        $review->delete();

select * from `reviews` where `reviews`.`deleted_at` is not null
---
    public function trashed()
    {
        return view('admin.review.trash', [
            'reviews' => Review::onlyTrashed()->get()
        ]);