app/Http/Controllers/Admin/UserController.php

select * from `users` where `role` = 'user' limit 15 offset 0
select count(*) as aggregate from `users` where `role` = 'user'
---
    public function index()
    {
        return view('admin.user.index', [
            'users' => User::filter(request(['search', 'role', 'status']))->paginate()
        ]);

update `users` set `role` = 'user', `users`.`updated_at` = '2025-07-02 16:03:11' where `id` = 3
---
    public function changeRole(Request $request, User $user)
    {
        if ($request->user()->id === $user->id) {
            return back()->with('fail', "You can't change role on yourself");
        }

        $request->validate([
            'role' => ['required', 'in:admin,moderator,user']
        ]);

        $user->role = $request->role;
        $user->save();